// Лабораторная работа номер 5
// Подпрограммы преобразования


/*
	~Набросок~

										** Структура:	
	
	|-------------------------------------------------------------------------------------------|
	|* Вход (main) -> Выбор режим перевода -> Ввод числа -> asm вставка -> Вывод числа в консоль|
	|-------------------------------------------------------------------------------------------|
	|																						    |
	|						  							   main()							    |
	|					 (Выбор режима перевода числа <------|-----> Выход из программы)	    |
	|								 	|								   |				    |
	|						     |While flag > 0|				 | EXIT if flag == 0 |		    |
	|									 |														|
	|	------------------------------------------------------------------						|
	|	|			|					 |					   |		 |						|
	|	|	  |flag == 1|			|flag == 2|           |flag == 3|	 |						|
	|	|			|					 |					   |		 |						|
	|	|	  DEC_to_HEX()  <----> 	DEC_to_BIN()  <---->  DEC_to_OCT()   |						|  
	|	|	   (10 -> 16)			 (10 -> 2)			   (10 -> 8)	 |						|
	|	|			|					 |                     |		 |						|
	|	|			|					 |					   |		 |						|
	|	------------------------------------------------------------------						|
	|-------------------------------------------------------------------------------------------|

	*/

#include <iostream>


using namespace std;

//
void DEC_to_HEX() 
{

}


//
void DEC_to_BIN() 
{

}


//
void DEC_to_OCT()
{

}


//
void info()
{
	char zero_data;
	cout << "--------------------------------------------------------------------------------------------------------------" << endl;
	cout << "|\n|\t\t\t\t\t\tРабочее задание\n|" << endl;
	cout << "|\t1. Ввести и отладить программу на ассемблере перевода целого числа (unsigned integer) в формат ASCII \n|  как HEX числа. Для ввода исходных данных и вывода результата использовать операторы С++." << endl;
	cout << "|\t2. Отладить аналогично программы перевода в формат ASCII в двоичной и восьмеричной форме представления " << endl;
	cout << "" << endl;
	cout << "" << endl;
	cout << "" << endl;
	cout << "" << endl;
	cout << "" << endl;
	cout << "|x| Введите любую клавишу, что бы продолжить...\n\n$->:";
	cin >> zero_data;
	system("cls");
}


//
int main() 
{
	system("chcp 1251 > nul");
	
	int flagAction, flagFormat;

	// Первое меню
	// 1 ---------
	do 
	{
											// 65 символа 
		cout << "-----------------------------------------------------------------" << endl;
		cout << "|\t\t Лабораторная работа номер 5.\t\t\t|\n|\t\t'Подпрограммы преобразования'\t\t\t|" << endl;
		cout << "-----------------------------------------------------------------" << endl;

		cout << "\t\t\tГлавное меню." << endl;
		cout << "\n|x| Выбор действия:\n\n0 - Выход; \n1 - Действие с данными; \n2 - Техническое задание;\n\n$->: ";
		cin >> flagAction;

		// Начало обработки первого меню
		// START 1 ---------------------
		switch (flagAction)
		{
		case 1:
			system("cls");
			
			// Второе меню
			// 2 ---------
			do
			{
				cout << "-----------------------------------------------------------------" << endl;
				cout << "|\t\t Лабораторная работа номер 5.\t\t\t|\n|\t\t'Подпрограммы преобразования'\t\t\t|" << endl;
				cout << "-----------------------------------------------------------------" << endl;

				cout << "\t\t\tМеню обработки данных." << endl;
				cout << "\n|x| Выберите необходимый формат данных:\n\n0 - Выход в главное меню; \n1 - Шестнадцатеричный; \n2 - Двоичный; \n3 - Восмеричный;\n\n$->: ";
				cin >> flagFormat;

				// Начало обработки второго меню
				// START 2 ---------------------
				switch (flagFormat)
				{
				case 1:
					DEC_to_HEX();
					break;
				case 2:
					DEC_to_BIN();
					break;
				case 3:
					DEC_to_OCT();
					break;
				}
				system("cls");
				if (flagFormat < 0 || flagFormat > 3) cout << "\n|!| Вы ввели неверное значение!\n" << endl;
				
			} while (flagFormat != 0);
			// Конец второго меню
			// END 2 ------------
			break;
		case 2:
			system("cls");
			info();
			break;
		}
		system("cls");
		if (flagAction < 0 || flagAction > 2) cout << "\n|!| Вы ввели неверное значение!\n" << endl;
	} while (flagAction != 0);
	// Конец первого меню
	// END 1 ------------

	cout << "\n|!| Завершение работы!" << endl;
	return 0;
}